class Demo{
	public static void main(String[] args){
	
		/*
		
			***
			***
			***
			
			------------
			
			*
			* *
			* * *
			
			---------------
			
			印结果：

			1*1=1 
			1*2=2 2*2=4 
			1*3=3 2*3=6 3*3=9 
			 
			
			------------
			****
			***
			**
			*
			
			
			****
			 ***
			  **
			   *
			   
			   
			     * 
			    **
			   ****
			  ******
			 ********  
			----------- 
			 
			 * * * *
			  * * *
			   * *
			    *
			
			
			
		*/
		
		//*
		
		//**
		//***
		
		//int v =1;
		for(int i=1;i<=3;i++){
		
			for(int j=0;j<i;j++){
				System.out.print("*");
		
			}
			System.out.println();
			//v =v+1
		
		}
		
		
		
		
		
		
	}
	
}