1,面向对象
	1，类以及成员
	2，现象对象的三大特征（封装，继承，多态）
	3，关键字
2,类以及成员
	类      对象(实例)
		一类事物（类class）：
			共同的特征，共同的功能
			作用：
				用来描述一类事物的类型
		对象：
			就是class的一个 实例（对象）
			
			
		class ---->对象（实例）  （对象的实例化）
		
			new
	什么是面向对象	?
		1，面向对象编程语言
		2，面向过程编程
		
		问题：
			要把大象装冰箱怎么办？
			
				1，设计一个冰箱
							--->
							尺寸
							门的个数
							怎么开门
							怎么关门
				2，设计一个动物：
							---体重
							---种类
							---大小
				3，实际一个人
							-----》大象管理员
							-----》 猴子管理员
		
			动物类型------》大象  new 
			冰箱类型------》 大冰箱
			人------》大象管理
			
			动物类型------》猴子  new 
			冰箱类型------》 小冰箱
			人------》猴子管理
			
	2，面向对象例子2：
		你不懂电脑的组装----》组装电脑的小哥
		
										----》配好了
											5000+200
											
							-----》拿回家
	
			小哥就是你的对象
			你：
				由执行者  ——---》指挥者 
				
				
	3， 你（男）----》
						对象（女朋友）  （权限）
				   default/protected---》做饭
							public 	---》打电话
							private	---》亲亲
								
	
			你：
				由执行者  ——---》指挥者 
	
代码实现面向对象：

写一个汽车类
Car

	1, 特征
	
	2, 功能
	
	访问和赋值
	
	3, 封装：
		1，访问修饰符 
			private  只有在本类中访问， 出了本类访问不到
			public  任何地方都可以访问
			
		
		控制：
		传递进来的三个边长的值必须是正数
		









	
	
	

		