1,数组用来存放数据：
	各种各样数据类型
	
	每个元素之间 必须是类型一样的
	
2, 如何来定义一个数值：
	int[] arr={1,3,4,5};
	
	int[] arr2 = new int[3];//定义一个长度为3的数组 的方法
	
	[1,2,3] --->[3,2,1] 
	
	
3,  在定义数组时内存图：
	
	int[]  arrr =  {};
	int[] arr = new int[];
4，jvm 垃圾回收机制：(GC)

		垃圾：
		在堆内存的对象，若果没有变量来引用他，就是垃圾，
	
	删除：
		通过一定的时间
		当内存占用达到n%
5,数组常用工具：
	

---------------------------------------
数组中出现的异常：
1， Array index out of bound exception
2， NullPointerException
---------------------------------------




